{
  "work": [
    {
      "name": "Technology Transformation Services (TTS), U.S. General Services Administration",
      "position": "Content strategist",
      "url": "https://tts.gsa.gov/",
      "startDate": "2024",
      "endDate": "2025",
      "highlights": ["Led content strategy and operations for a six-person team", "Composed and maintained the Digital.gov product roadmap", "Oversaw content migration for Digital.gov transition to Drupal CMS, archiving more than 2,000 pages of redundant or outdated content (52% of total pages)", "Supported eight government-wide communities of practice with more than 16,000 members"]
    },
    {
      "name": "School of Government, University of North Carolina at Chapel Hill",
      "position": "Director of content strategy",
      "url": "https://sog.unc.edu",
      "startDate": "2022",
      "endDate": "2024",
      "highlights": ["Established cross-functional teams to support the launch and continuous improvement of digital products and services", "Led discovery and delivery for new digital products, including a digital asset management platform, fellowship program site redesign, and statewide impact website"]
    },
    {
      "name": "School of Government, University of North Carolina at Chapel Hill",
      "position": "Advancement communications manager",
      "url": "https://sog.unc.edu",
      "startDate": "2019",
      "endDate": "2022",
      "highlights": ["Shaped advancement communications and major gift proposals during the Campaign for Carolina, surpassing the School of Government campaign goal of $50 million"]
    },
    {
      "name": "Robert J. Dole Institute of Politics, University of Kansas",
      "position": "Director of communications",
      "url": "https://www.doleinstitute.org",
      "startDate": "2015",
      "endDate": "2019",
      "highlights": ["Oversaw a diverse portfolio of content responsibilities", "Assumed leadership of production team and contractors, including budget, procurement, hardware upgrades, and improved accessibility standards"]
    },
    {
      "name": "Department of Intercollegiate Athletics, University of Oklahoma",
      "position": "Assistant Director of Communications",
      "url": "https://www.soonersports.com",
      "startDate": "2013",
      "endDate": "2015",
      "highlights": ["Served as primary sport contact for women’s gymnastics (2014 NCAA Champions), soccer, and as local media coordinator for the Women’s College World Series", "Created comprehensive annual content plans to increase awareness and attendance for varsity teams", "Created social media content strategy for assigned sports, resulting in gains of more than 19,000 followers across all platforms for assigned sports"]
    }
  ],
  "education": [
    {
      "institution": "University of North Carolina at Chapel Hill",
      "url": "https://mpa.unc.edu",
      "studyType": "Master of Public Administration"
    },
    {
      "institution": " University of Nebraska–Lincoln",
      "url": "https://www.unl.edu",
      "studyType": "Bachelor of Journalism with highest distinction"    }
  ],
  "publications": [
    {
      "name": "Expectations vs. reality: Retention challenges and strategies for U.S. state and local government digital services teams",
      "releaseDate": "2025",
      "url": "https://digitalgovernmenthub.org/library/expectations-vs-reality-retention-challenges-and-strategies-for-u-s-state-and-local-government-digital-services-teams/",
      "summary": "This paper examines the challenges U.S. state and local digital service teams face in retaining talent and offers strategies to improve retention and team stability."
    },
      {
      "name": "Insights Into Hiring for Digital Service Teams",
      "publisher": "Beeck Center for Social Impact and Innovation at Georgetown University",
      "releaseDate": "2023",
      "url": "https://digitalgovernmenthub.org/library/insights-into-hiring-for-digital-service-teams/",
      "summary": "A report examining hiring practices, challenges, and lessons learned from U.S. digital service teams."
    },
      {
      "name": "Game-Changer: A Case Study of Social Media Strategy in Big Ten Athletic Departments",
      "publisher": "International Journal of Sport Communication",
      "releaseDate": "2014",
      "url": "https://journals.humankinetics.com/view/journals/ijsc/7/4/article-p516.xml",
      "summary": "This study used a case-study approach to develop an understanding of how social-media strategy is developed and deployed in Big Ten Conference athletic departments."
    }
  ]
}